Tests:

HYD-ML-00064439:terraform-provider-bigip papineni$ cat test.tf 

resource "bigip_ltm_profile_fastl4" "PFL_FL4_OBO_PARENT" {
  name                         = "/Common/PFL_FL4_OBO_PARENT"
  defaults_from                = "/Common/fastL4"
  partition                    = "Common"
  idle_timeout                 = 301
  iptos_toclient         = "pass-through"
  iptos_toserver         = "pass-through"
  keepalive_interval     = "disabled" //This cannot take enabled
}

resource "bigip_ltm_profile_fastl4" "PFL_FL4_OBO_EVAL" {
  name                         = "/Common/PFL_FL4_OBO_EVAL"
  defaults_from                = "/Common/PFL_FL4_OBO_PARENT"
  depends_on = [bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT]
}

HYD-ML-00064439:terraform-provider-bigip papineni$ 


HYD-ML-00064439:terraform-provider-bigip papineni$ terraform init
2020/07/20 22:57:08 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

Initializing the backend...

Initializing provider plugins...

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply
2020/07/20 22:57:14 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL will be created
  + resource "bigip_ltm_profile_fastl4" "PFL_FL4_OBO_EVAL" {
      + client_timeout         = (known after apply)
      + defaults_from          = "/Common/PFL_FL4_OBO_PARENT"
      + explicitflow_migration = (known after apply)
      + hardware_syncookie     = (known after apply)
      + id                     = (known after apply)
      + idle_timeout           = (known after apply)
      + iptos_toclient         = (known after apply)
      + iptos_toserver         = (known after apply)
      + keepalive_interval     = (known after apply)
      + name                   = "/Common/PFL_FL4_OBO_EVAL"
      + partition              = (known after apply)
    }

  # bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT will be created
  + resource "bigip_ltm_profile_fastl4" "PFL_FL4_OBO_PARENT" {
      + client_timeout         = (known after apply)
      + defaults_from          = "/Common/fastL4"
      + explicitflow_migration = (known after apply)
      + hardware_syncookie     = (known after apply)
      + id                     = (known after apply)
      + idle_timeout           = "301"
      + iptos_toclient         = "pass-through"
      + iptos_toserver         = "pass-through"
      + keepalive_interval     = "disabled"
      + name                   = "/Common/PFL_FL4_OBO_PARENT"
      + partition              = "Common"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT: Creating...
bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT: Creation complete after 1s [id=/Common/PFL_FL4_OBO_PARENT]
bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL: Creating...
bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL: Creation complete after 1s [id=/Common/PFL_FL4_OBO_EVAL]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform apply. ------------------> second terraform apply
2020/07/20 22:57:24 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT: Refreshing state... [id=/Common/PFL_FL4_OBO_PARENT]
bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL: Refreshing state... [id=/Common/PFL_FL4_OBO_EVAL]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ terraform destroy
2020/07/20 22:57:36 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT: Refreshing state... [id=/Common/PFL_FL4_OBO_PARENT]
bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL: Refreshing state... [id=/Common/PFL_FL4_OBO_EVAL]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  - destroy

Terraform will perform the following actions:

  # bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL will be destroyed
  - resource "bigip_ltm_profile_fastl4" "PFL_FL4_OBO_EVAL" {
      - client_timeout         = 30 -> null
      - defaults_from          = "/Common/PFL_FL4_OBO_PARENT" -> null
      - explicitflow_migration = "disabled" -> null
      - hardware_syncookie     = "disabled" -> null
      - id                     = "/Common/PFL_FL4_OBO_EVAL" -> null
      - idle_timeout           = "301" -> null
      - iptos_toclient         = "pass-through" -> null
      - iptos_toserver         = "pass-through" -> null
      - keepalive_interval     = "disabled" -> null
      - name                   = "/Common/PFL_FL4_OBO_EVAL" -> null
      - partition              = "Common" -> null
    }

  # bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT will be destroyed
  - resource "bigip_ltm_profile_fastl4" "PFL_FL4_OBO_PARENT" {
      - client_timeout         = 30 -> null
      - defaults_from          = "/Common/fastL4" -> null
      - explicitflow_migration = "disabled" -> null
      - hardware_syncookie     = "disabled" -> null
      - id                     = "/Common/PFL_FL4_OBO_PARENT" -> null
      - idle_timeout           = "301" -> null
      - iptos_toclient         = "pass-through" -> null
      - iptos_toserver         = "pass-through" -> null
      - keepalive_interval     = "disabled" -> null
      - name                   = "/Common/PFL_FL4_OBO_PARENT" -> null
      - partition              = "Common" -> null
    }

Plan: 0 to add, 0 to change, 2 to destroy.

Do you really want to destroy all resources?
  Terraform will destroy all your managed infrastructure, as shown above.
  There is no undo. Only 'yes' will be accepted to confirm.

  Enter a value: yes

2020/07/20 22:57:42 DestroyEdgeTransformer: pruning unused resource node bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT (prepare state)
2020/07/20 22:57:42 DestroyEdgeTransformer: pruning unused resource node bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL (prepare state)
bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL: Destroying... [id=/Common/PFL_FL4_OBO_EVAL]
bigip_ltm_profile_fastl4.PFL_FL4_OBO_EVAL: Destruction complete after 1s
bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT: Destroying... [id=/Common/PFL_FL4_OBO_PARENT]
bigip_ltm_profile_fastl4.PFL_FL4_OBO_PARENT: Destruction complete after 1s

Destroy complete! Resources: 2 destroyed.
HYD-ML-00064439:terraform-provider-bigip papineni$ 